---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
source: html/cdad5c9b-5ec1-cefc-9278-3930b77e00c6.htm
---
# FileArgumentAlreadyExistsException Methods

Retrieves data needed to serialize the target object.